# NumberedElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem..::..NumberedElementId Property
NumberSystem Class See Also
---
The LinkElementId of the numbered host element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LinkElementId NumberedElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberedElementId As LinkElementId
	Get
```

Visual C++
---
```text
public:
property LinkElementId^ NumberedElementId {
	LinkElementId^ get ();
}
```

# See Also
NumberSystem Class
Autodesk.Revit.DB Namespace